{
  "node": [
    {
      "company": "University of Indonesia",
      "position": "Researcher",
      "src": "./universityofindonesia.png",
      "startDate": "Jan 2023",
      "endDate": "May 2023",
      "highlights": [
        "Wrote thesis titled Load Balancing Analysis on App Performance in Geo-Distributed Kubernetes Clusters.",
        "Developed and deployed application to geo-distributed Kubernetes clusters using multi-cluster resources on GCP.",
        "Configured Istio service mesh for location-aware load balancing and measured performance using Vegeta load test tool."
      ]
    },
    {
      "company": "Traveloka",
      "position": "Backend Engineer Intern",
      "src": "./traveloka.png",
      "startDate": "Aug 2022",
      "endDate": "Dec 2022",
      "highlights": [
        "Integrated Salesforce and Datadog Monitoring & Alert using Terraform, AWS Lambda, and Java.",
        "Increased user engagement by creating routing logic for Traveloka Priority users using Java and Terraform.",
        "Automated GitHub release tag using Github Actions."
      ]
    },
    {
      "company": "Ruangguru",
      "position": "Backend Engineer Intern",
      "src": "./ruangguru.png",
      "startDate": "Feb 2022",
      "endDate": "Apr 2022",
      "highlights": [
        "Prevented millions in losses by integrating rate limiting on hundreds of services using Go, Kubernetes, Istio, and Envoy."
      ]
    },
    {
      "company": "Dekoruma",
      "position": "Software Engineer Intern",
      "src": "./dekoruma.png",
      "startDate": "Jun 2021",
      "endDate": "Jan 2022",
      "highlights": [
        "Increased Paid GMV by 100M by adding Shipping Calculation Info using Django REST Framework and React Native.",
        "Improved revenue, traffic, and SEO by developing dekoruma.com/artikel using NextJS, React Query, and Algolia."
      ]
    },
    {
      "company": "OY Indonesia",
      "position": "Software Engineer Intern",
      "src": "./oyindonesia.png",
      "startDate": "Sep 2020",
      "endDate": "Mar 2021",
      "highlights": [
        "Increased revenue by 30% by developing end-to-end Promo Code feature using Flutter with BloC state management.",
        "Applied Data Access Object(DAO) and Model Controller Service(MCS) Design Patterns in Java Backend architecture.",
        "Utilized RabbitMQ for publishing and consuming events to validate user eligibility on promo codes and rewards."
      ]
    },
    {
      "company": "Mekari",
      "position": "Software Engineer Intern",
      "src": "./mekari.png",
      "startDate": "Jul 2020",
      "endDate": "Sep 2020",
      "highlights": [
        "Developed and automated Backend using Python, Selenium, and AWS (Amplify, Lambda, Secrets Manager, S3, SES).",
        "Utilized Docker, AWS-CLI, and serverless CLI to create and deploy AWS Lambda dependency layers."
      ]
    }
  ]
}

